MatPhys/matphys_ht9.org
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{esint}
#+LATEX_HEADER:\usepackage[english,russian]{babel}
#+LATEX_HEADER:\usepackage{mathtools}
#+LATEX_HEADER:\usepackage{amsthm}
#+OPTIONS: toc:nil
#+LATEX_HEADER:\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}

#+LATEX_HEADER:\def\zall{\setcounter{lem}{0}\setcounter{cnsqnc}{0}\setcounter{th}{0}\setcounter{Cmt}{0}\setcounter{equation}{0}}

#+LATEX_HEADER:\newcounter{lem}\setcounter{lem}{0}
#+LATEX_HEADER:\def\lm{\par\smallskip\refstepcounter{lem}\textbf{\arabic{lem}}}
#+LATEX_HEADER:\newtheorem*{Lemma}{Лемма \lm}

#+LATEX_HEADER:\newcounter{th}\setcounter{th}{0}
#+LATEX_HEADER:\def\th{\par\smallskip\refstepcounter{th}\textbf{\arabic{th}}}
#+LATEX_HEADER:\newtheorem*{Theorem}{Теорема \th}

#+LATEX_HEADER:\newcounter{cnsqnc}\setcounter{cnsqnc}{0}
#+LATEX_HEADER:\def\cnsqnc{\par\smallskip\refstepcounter{cnsqnc}\textbf{\arabic{cnsqnc}}}
#+LATEX_HEADER:\newtheorem*{Consequence}{Следствие \cnsqnc}

#+LATEX_HEADER:\newcounter{Cmt}\setcounter{Cmt}{0}
#+LATEX_HEADER:\def\cmt{\par\smallskip\refstepcounter{Cmt}\textbf{\arabic{Cmt}}}
#+LATEX_HEADER:\newtheorem*{Note}{Замечание \cmt}

#+LATEX_HEADER:\renewcommand{\div}{\operatorname{div}}
#+LATEX_HEADER:\newcommand{\rot}{\operatorname{rot}}
#+LATEX_HEADER:\newcommand{\grad}{\operatorname{grad}}

\zall

ДЗ: 8.6, 8.9, 9.1-9.7(прочитать), 9.12, 9.20, 9.13, 9.10, 9.17
* Задача 8.6
#+BEGIN_EXPORT latex
Найти функцию Грина и решить задачу Дирихле в области:
\begin{equation}
y > 0, z > 0
\end{equation}
#+END_EXPORT
** Решение
#+BEGIN_EXPORT latex
Рассмотрим точку $Q(x_0, y_0, z_0)$. Введём точки $Q_1(x_0, -y_0, z_0), Q_2(x_0, -y_0, -z_0), Q_3(x_0, y_0, -z_0)$.
Тогда, поскольку $G(P, Q)$ на границе равна нулю, она имеет вид:
\begin{multline}
G(P, Q) = \frac1{4\pi r_{PQ}} - \frac1{4\pi r_{PQ_1}} + \frac1{4\pi r_{PQ_2}} - \frac1{4\pi r_{PQ_3}} =
\frac1{4\sqrt{(x - x_0)^2 + (y - y_0)^2 + (z - z_0)^2}} - \\
- \frac1{4\sqrt{(x - x_0)^2 + (y + y_0)^2 + (z - z_0)^2}} +
\frac1{4\sqrt{(x - x_0)^2 + (y + y_0)^2 + (z + z_0)^2}} - \\
- \frac1{4\sqrt{(x - x_0)^2 + (y - y_0)^2 + (z + z_0)^2}}
\end{multline}
Далее решение можно найти из формулы Грина:
\begin{equation}
u(Q) = -\iint_Sf(P)\frac{\partial G}{\partial n_P}dS_P
\end{equation}
#+END_EXPORT
* Задача 8.9
#+BEGIN_EXPORT latex
Найти функцию Грина и решить задачу Дирихле в области:
\begin{equation}
x^2 + y^2 + z^2 < 1
\end{equation}
#+END_EXPORT
** Решение
#+BEGIN_EXPORT latex
Рассмотрим точку $Q(x_0, y_0, z_0)$. Рассмотрим симметричную ей относительно окружности точку
$$Q'\left(\frac{x_0}{x_0^2 + y_0^2 + z_0^2}, \frac{y_0}{x_0^2 + y_0^2 + z_0^2}, \frac{z_0}{x_0^2 + y_0^2 + z_0^2}\right)$$
Тогда функция Грина будет иметь вид:
\begin{equation}
G(P, Q) = \frac1{4\pi r_{PQ}} - \frac1{\sqrt{x_0^2 + y_0^2 + z_0^2}}\frac1{4\pi r_{PQ'}}
\end{equation}
Решение можно найти из теоремы о среднем:
\begin{equation}
u(Q) = \frac1{4\pi a^2}\oiint_Sudl
\end{equation}
#+END_EXPORT
